<template>
  <div id="canvas" class="container " :style="backgroundStyle">
    <div class="control-group">
      <button class="btn" @click="onChangeBg(-1)">
        < </button>
          <div>
            <h3>更换背景</h3>
          </div>
          <button class="btn" @click="onChangeBg(1)">></button>
    </div>
    <div class="icon-gruop">
      <div class="icon-wrapper" :style="iconStyle">
        <svg t="1716192057581" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
          p-id="1450" width="200" height="200">
          <path d="M908 836H116A36 36 0 0 1 80 800V296h864V800a36 36 0 0 1-36 36z" fill="#4D4D4D" p-id="1451"></path>
          <path
            d="M916 181.6H108.16a36.8 36.8 0 0 0-36.8 36.64v587.52a36.96 36.96 0 0 0 36.8 36.8h807.84a36.8 36.8 0 0 0 36.64-36.8V218.24a36.96 36.96 0 0 0-36.64-36.64z"
            fill="#333333" opacity=".1" p-id="1452"></path>
          <path d="M80 314.08h288v-126.08H116A36 36 0 0 0 80 224z" fill="#E0DDD8" p-id="1453"></path>
          <path d="M656 188H368v126.08h288z" fill="#3E92CC" p-id="1454"></path>
          <path d="M944 314.08H656v-126.08h252A36 36 0 0 1 944 224z" fill="#0A2463" p-id="1455"></path>
          <path
            d="M356 512L189.76 678.24a19.68 19.68 0 0 0-2.56 27.68l2.56 2.56L224 742.4a19.68 19.68 0 0 0 27.68 2.56l2.56-2.56L420.32 576a19.68 19.68 0 0 0 2.56-27.68 19.36 19.36 0 0 0-2.56-2.56L386.24 512a23.04 23.04 0 0 0-30.24 0z"
            opacity=".1" p-id="1456"></path>
          <path
            d="M353.6 517.44l-158.4 158.4a18.56 18.56 0 0 0-2.4 26.4l2.4 2.4 32 32a18.72 18.72 0 0 0 26.4 2.56L256 736l158.4-158.4a18.56 18.56 0 0 0 2.4-26.4 16.96 16.96 0 0 0-2.4-2.4l-32-32a21.76 21.76 0 0 0-28.8 0.64z"
            fill="#C0C0C0" p-id="1457"></path>
          <path
            d="M253.92 385.92l166.4 166.24a19.68 19.68 0 0 1 2.56 27.68l-2.56 2.56-34.08 34.08a19.68 19.68 0 0 1-27.68 2.56 19.36 19.36 0 0 1-2.56-2.56l-166.24-166.4a19.68 19.68 0 0 1-2.56-27.68l2.56-2.56L224 385.92a22.72 22.72 0 0 1 29.92 0z"
            opacity=".1" p-id="1458"></path>
          <path
            d="M256 391.36l158.4 158.4a18.56 18.56 0 0 1 2.4 26.24 16.96 16.96 0 0 1-2.4 2.4l-32 32a18.56 18.56 0 0 1-26.4 2.4 16.96 16.96 0 0 1-2.4-2.4l-158.4-158.4a18.56 18.56 0 0 1-2.4-26.4 16.96 16.96 0 0 1 2.4-2.4l32-32a21.92 21.92 0 0 1 28.8 0.16z"
            fill="#EBEBEB" p-id="1459"></path>
          <path
            d="M462.4 670.56m33.28 0l462.4 0q33.28 0 33.28 33.28l0 151.36q0 33.28-33.28 33.28l-462.4 0q-33.28 0-33.28-33.28l0-151.36q0-33.28 33.28-33.28Z"
            fill="#CFD4F0" p-id="1460"></path>
          <path
            d="M604.16 802.56v48.8h-22.4v-134.72h40.96a54.72 54.72 0 0 1 36 10.72 38.08 38.08 0 0 1 12.8 30.56 42.56 42.56 0 0 1-13.28 32 51.2 51.2 0 0 1-36.16 12.48z m0-67.52V784h14.4a32 32 0 0 0 21.44-6.4 24.8 24.8 0 0 0 7.52-18.88c0-16-9.12-23.68-27.68-23.68z m194.56 116.32h-26.24L751.04 816a49.6 49.6 0 0 0-5.76-8.48 32 32 0 0 0-5.6-5.92 19.2 19.2 0 0 0-6.24-3.2 25.44 25.44 0 0 0-7.68-1.12h-8.96v54.72h-22.4v-135.36h44.48a58.08 58.08 0 0 1 17.44 2.24 34.56 34.56 0 0 1 13.92 6.88 29.12 29.12 0 0 1 9.28 11.36 34.24 34.24 0 0 1 3.36 16 40.32 40.32 0 0 1-2.24 13.12 35.2 35.2 0 0 1-5.92 10.72 40.48 40.48 0 0 1-9.44 7.84 48.96 48.96 0 0 1-12.32 5.12 36.32 36.32 0 0 1 6.4 4.64l5.12 5.12a43.04 43.04 0 0 1 4.8 5.92 85.76 85.76 0 0 1 5.44 7.84z m-81.92-116.64v43.84H736a28.16 28.16 0 0 0 9.6-1.6 19.2 19.2 0 0 0 7.52-4.64 20.64 20.64 0 0 0 4.96-7.36 21.76 21.76 0 0 0 1.76-9.6 18.88 18.88 0 0 0-6.08-16 24.96 24.96 0 0 0-17.6-5.44z m173.44 116.64H814.4v-134.72h72.8V736H836.8v38.24h46.4v18.88h-46.4V832h53.44z"
            p-id="1461"></path>
          <path
            d="M489.12 663.52h475.52a34.88 34.88 0 0 1 34.24 35.36v161.28A35.04 35.04 0 0 1 964.96 896H489.12a34.88 34.88 0 0 1-34.24-35.36V698.88a34.88 34.88 0 0 1 34.24-35.36z"
            opacity=".1" p-id="1462"></path>
        </svg>
        <span>Terminal</span> 
      </div>
      <div class="icon-wrapper" :style="iconStyle">
        <svg t="1716192082164" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
          p-id="1618" width="200" height="200">
          <path
            d="M590.4 536s185.6-104 188.8-102.4a270.448 270.448 0 0 0-328-195.2 266.192 266.192 0 0 0-158.4 113.6c1.6 0 297.6 184 297.6 184z"
            fill="#0364B8" p-id="1619"></path>
          <path
            d="M409.6 384a217.488 217.488 0 0 0-113.6-32h-3.2A216.16 216.16 0 0 0 80 571.2a223.088 223.088 0 0 0 38.4 121.6L416 662.4l174.4-168z"
            fill="#0F78D4" p-id="1620"></path>
          <path
            d="M780.8 433.6h-11.2a165.696 165.696 0 0 0-68.8 14.4L592 492.8l118.4 131.2 214.4 67.2a175.472 175.472 0 0 0-72-238.4 192.848 192.848 0 0 0-72-19.2z"
            fill="#1490DF" p-id="1621"></path>
          <path
            d="M769.6 600l-44.8-27.2-102.4-60.8-32-19.2-81.6 35.2-158.4 67.2-72 28.8-160 67.2A217.712 217.712 0 0 0 296 784H768a177.84 177.84 0 0 0 155.2-92.8z"
            fill="#28A8EA" p-id="1622"></path>
        </svg>
        <span>iCloud</span>
      </div>
      <div class="icon-wrapper" :style="iconStyle">
        <svg t="1716192112352" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
          p-id="1778" width="200" height="200">
          <path
            d="M944 508v8A381.168 381.168 0 0 1 564 896h-8a378.4 378.4 0 0 1-268.64-112c-5.12-5.12-10.24-10.56-15.04-16-4.64-5.12-9.12-10.56-13.44-16A376.96 376.96 0 0 1 176 516v-8A376 376 0 0 1 246.88 288a189.328 189.328 0 0 1 12-16 379.264 379.264 0 0 1 297.12-144h8A381.168 381.168 0 0 1 944 508z"
            fill="#D35230" p-id="1779"></path>
          <path d="M944 512v-3.648A381.472 381.472 0 0 0 563.648 128H560v384z" fill="#FF8F6B" p-id="1780"></path>
          <path d="M176 508.352V512h384V128h-3.632A381.472 381.472 0 0 0 176 508.352z" fill="#ED6C47" p-id="1781">
          </path>
          <path
            d="M528 325.28v421.44a27.744 27.744 0 0 1-0.64 6.4A37.024 37.024 0 0 1 490.72 784H287.36c-5.12-5.12-10.24-10.56-15.04-16-4.64-5.12-9.12-10.56-13.44-16A376.96 376.96 0 0 1 176 516v-8A376 376 0 0 1 246.88 288h243.84A37.216 37.216 0 0 1 528 325.28z"
            p-id="1782"></path>
          <path
            d="M544 325.28v389.44A53.792 53.792 0 0 1 490.72 768H272.32c-4.64-5.12-9.12-10.56-13.44-16A376.96 376.96 0 0 1 176 516v-8A376 376 0 0 1 246.88 288a189.328 189.328 0 0 1 12-16h231.84A53.472 53.472 0 0 1 544 325.28z"
            p-id="1783"></path>
          <path
            d="M528 325.28v389.44A37.216 37.216 0 0 1 490.72 752H258.88A376.96 376.96 0 0 1 176 516v-8A376 376 0 0 1 246.88 288h243.84A37.216 37.216 0 0 1 528 325.28z"
            p-id="1784"></path>
          <path
            d="M512 325.28v389.44A37.216 37.216 0 0 1 474.72 752H258.88A376.96 376.96 0 0 1 176 516v-8A376 376 0 0 1 246.88 288h227.84A37.216 37.216 0 0 1 512 325.28z"
            p-id="1785"></path>
          <path
            d="M64 288m37.344 0l373.312 0q37.344 0 37.344 37.344l0 373.312q0 37.344-37.344 37.344l-373.312 0q-37.344 0-37.344-37.344l0-373.312q0-37.344 37.344-37.344Z"
            fill="#C43E1C" p-id="1786"></path>
          <path
            d="M295.408 386.512a98.624 98.624 0 0 1 66.432 19.968 72.304 72.304 0 0 1 23.056 57.792 82.08 82.08 0 0 1-11.392 43.216 77.008 77.008 0 0 1-32.432 29.424 107.648 107.648 0 0 1-48.704 10.496h-46.096v88h-47.28V386.512z m-49.136 122.88h40.688a51.92 51.92 0 0 0 35.968-11.008 41.248 41.248 0 0 0 12.16-32.208q0-41.12-46.608-41.12h-42.208z"
            fill="#FFFFFF" p-id="1787"></path>
        </svg>
        <span>Powerpoint</span>
      </div>
      <div class="icon-wrapper" :style="iconStyle">
        <svg t="1716192117600" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
          p-id="1943" width="200" height="200">
          <path
            d="M896 896H309.312A37.312 37.312 0 0 1 272 858.688V165.312A37.312 37.312 0 0 1 309.312 128h597.376a37.184 37.184 0 0 1 37.152 37.312L944 848a58.16 58.16 0 0 1-48 48z"
            fill="#CA64EA" p-id="1944"></path>
          <path d="M752 320h192v192H752z" fill="#AE4BD5" p-id="1945"></path>
          <path d="M752 512h192v192H752z" fill="#9332BF" p-id="1946"></path>
          <path d="M752 704h192v154.72A37.28 37.28 0 0 1 906.72 896H752V704z" fill="#7719AA" p-id="1947"></path>
          <path
            d="M528 325.28v421.44a27.744 27.744 0 0 1-0.64 6.4A37.024 37.024 0 0 1 490.72 784H272V288h218.72A37.216 37.216 0 0 1 528 325.28z"
            p-id="1948"></path>
          <path d="M544 325.28v389.44A53.792 53.792 0 0 1 490.72 768H272V272h218.72A53.472 53.472 0 0 1 544 325.28z"
            p-id="1949"></path>
          <path d="M528 325.28v389.44A37.216 37.216 0 0 1 490.72 752H272V288h218.72A37.216 37.216 0 0 1 528 325.28z"
            p-id="1950"></path>
          <path d="M512 325.28v389.44A37.216 37.216 0 0 1 474.72 752H272V288h202.72A37.216 37.216 0 0 1 512 325.28z"
            p-id="1951"></path>
          <path
            d="M64 288m37.328 0l373.344 0q37.328 0 37.328 37.328l0 373.344q0 37.328-37.328 37.328l-373.344 0q-37.328 0-37.328-37.328l0-373.344q0-37.328 37.328-37.328Z"
            fill="#7719AA" p-id="1952"></path>
          <path
            d="M186.704 390.672h50.608l99.44 160.928q6.8 10.832 10.192 17.44h0.64a246.992 246.992 0 0 1-1.44-33.008v-145.36h43.152v242.656h-47.36L238.752 468a129.792 129.792 0 0 1-9.216-17.088h-0.8a354.336 354.336 0 0 1 1.28 36.208v146.208H186.72z"
            fill="#FFFFFF" p-id="1953"></path>
        </svg>
        <span>OneNote</span>
      </div>
      <div class="icon-wrapper" :style="iconStyle">
        <svg t="1716192144494" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
          p-id="2275" width="200" height="200">
          <path
            d="M906.672 128H309.328A37.328 37.328 0 0 0 272 165.328V320l352 80 320-80v-154.672A37.328 37.328 0 0 0 906.672 128z"
            fill="#41A5EE" p-id="2276"></path>
          <path d="M944 320H272v192l352 96 320-96V320z" fill="#2B7CD3" p-id="2277"></path>
          <path d="M272 512v192l352 112 320-112V512H272z" fill="#185ABD" p-id="2278"></path>
          <path
            d="M309.328 896h597.344A37.328 37.328 0 0 0 944 858.672V704H272v154.672A37.328 37.328 0 0 0 309.328 896z"
            fill="#103F91" p-id="2279"></path>
          <path
            d="M528 325.28v421.44a27.744 27.744 0 0 1-0.64 6.4A37.024 37.024 0 0 1 490.72 784H272V288h218.72A37.216 37.216 0 0 1 528 325.28z"
            p-id="2280"></path>
          <path d="M544 325.28v389.44A53.792 53.792 0 0 1 490.72 768H272V272h218.72A53.472 53.472 0 0 1 544 325.28z"
            p-id="2281"></path>
          <path d="M528 325.28v389.44A37.216 37.216 0 0 1 490.72 752H272V288h218.72A37.216 37.216 0 0 1 528 325.28z"
            p-id="2282"></path>
          <path d="M512 325.28v389.44A37.216 37.216 0 0 1 474.72 752H272V288h202.72A37.216 37.216 0 0 1 512 325.28z"
            p-id="2283"></path>
          <path
            d="M64 288m37.328 0l373.344 0q37.328 0 37.328 37.328l0 373.344q0 37.328-37.328 37.328l-373.344 0q-37.328 0-37.328-37.328l0-373.344q0-37.328 37.328-37.328Z"
            fill="#185ABD" p-id="2284"></path>
          <path
            d="M217.184 574.272q1.104 8.64 1.44 15.056h0.848q0.496-6.08 1.936-14.72t2.8-14.56l39.264-169.376h50.768l40.608 166.848a242.08 242.08 0 0 1 5.072 31.472h0.688a240.288 240.288 0 0 1 4.224-30.448l32.48-167.872h46.208l-56.864 242.656h-53.984L293.92 472.576q-1.68-6.944-3.808-18.112-2.112-11.168-2.624-16.24h-0.672q-0.672 5.92-2.624 17.6t-3.12 17.248l-36.384 160.256h-54.832L132.48 390.672h47.04l35.376 169.728q1.184 5.248 2.288 13.872z"
            fill="#FFFFFF" p-id="2285"></path>
        </svg>
        Word
      </div>
      <div class="icon-wrapper" :style="iconStyle">
        <svg t="1716192178849" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
          p-id="2601" width="200" height="200">
          <path d="M572.8 579.2h156.8l179.2 49.6 108.8-219.2-299.2-248-145.6 417.6z" fill="#07C3F2" p-id="2602"></path>
          <path d="M438.4 0L62.4 156.8 0 819.2l206.4-22.4 147.2-62.4 4.8-105.6L416 323.2 668.8 152 438.4 0z"
            fill="#21D789" p-id="2603"></path>
          <path d="M288 388.8L0 819.2 350.4 1024l94.4-110.4L416 323.2l-128 65.6z" fill="#FCF84A" p-id="2604"></path>
          <path d="M761.6 0L448 280h355.2L761.6 0z" fill="#21D789" p-id="2605"></path>
          <path d="M464 280l-48 43.2-120 582.4 416 116.8L1024 915.2 896 432l-201.6 78.4L718.4 256 464 280z"
            fill="#FCF84A" p-id="2606"></path>
          <path d="M192 832h640V192H192v640z" p-id="2607"></path>
          <path
            d="M256 752h240v-40H256V752zM359.68 409.12A41.12 41.12 0 0 0 405.44 368c0-26.88-17.92-41.12-46.88-41.12h-44.8v83.04zM256 272h107.36c62.72 0 100.64 38.4 100.64 94.08v0.8c0 62.88-47.2 96-106.24 96h-44V544H256z m227.04 136.96a134.72 134.72 0 0 1 138.4-137.12 136.48 136.48 0 0 1 104.48 40.96l-37.12 42.88a97.92 97.92 0 0 0-67.84-29.92A78.56 78.56 0 0 0 544 407.52a78.56 78.56 0 0 0 76.8 83.36 96 96 0 0 0 69.76-31.04l37.12 37.6a135.84 135.84 0 0 1-108.8 48 134.08 134.08 0 0 1-136-136.48"
            fill="#FFFFFF" p-id="2608"></path>
        </svg>
        <span>Pycharm</span>
      </div>
      <div class="icon-wrapper" :style="iconStyle">
        <svg t="1716195536121" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
          p-id="3815" width="200" height="200">
          <path
            d="M918.673 883H104.327C82.578 883 65 867.368 65 848.027V276.973C65 257.632 82.578 242 104.327 242h814.346C940.422 242 958 257.632 958 276.973v571.054C958 867.28 940.323 883 918.673 883z"
            fill="#FFE9B4" p-id="3816"></path>
          <path
            d="M512 411H65V210.37C65 188.597 82.598 171 104.371 171h305.92c17.4 0 32.71 11.334 37.681 28.036L512 411z"
            fill="#FFB02C" p-id="3817"></path>
          <path
            d="M918.673 883H104.327C82.578 883 65 865.42 65 843.668V335.332C65 313.58 82.578 296 104.327 296h814.346C940.422 296 958 313.58 958 335.332v508.336C958 865.32 940.323 883 918.673 883z"
            fill="#FFCA28" p-id="3818"></path>
        </svg>
        <span>文件夹1</span>
      </div>
      <div class="icon-wrapper" :style="iconStyle">
        <svg t="1716195536121" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
          p-id="3815" width="200" height="200">
          <path
            d="M918.673 883H104.327C82.578 883 65 867.368 65 848.027V276.973C65 257.632 82.578 242 104.327 242h814.346C940.422 242 958 257.632 958 276.973v571.054C958 867.28 940.323 883 918.673 883z"
            fill="#FFE9B4" p-id="3816"></path>
          <path
            d="M512 411H65V210.37C65 188.597 82.598 171 104.371 171h305.92c17.4 0 32.71 11.334 37.681 28.036L512 411z"
            fill="#FFB02C" p-id="3817"></path>
          <path
            d="M918.673 883H104.327C82.578 883 65 865.42 65 843.668V335.332C65 313.58 82.578 296 104.327 296h814.346C940.422 296 958 313.58 958 335.332v508.336C958 865.32 940.323 883 918.673 883z"
            fill="#FFCA28" p-id="3818"></path>
        </svg>
        <span>文件夹2</span>
      </div>
    </div>
  </div>

</template>
<script setup>
import { computed, onMounted, ref } from 'vue'
const currentImageIndex = ref(0);
const backgroundStyle = computed(() => {
  return {
    backgroundImage: `url('/${currentImageIndex.value}.jpg')`,
    backgroundSize: 'cover',
    backgroundPosition: 'center',
    height: '98vh', // 容器高度设为视口全高
    width: '99vw'
  }
});
const iconStyle = ref({
  // transform: "scale(1.2) rotate(360deg)"
})
const onChangeBg = (idx) => {
  console.log(currentImageIndex.value);
  currentImageIndex.value += idx;
  if (currentImageIndex.value > 7) {
    currentImageIndex.value = 0
  }
  else if (currentImageIndex.value < 0) {
    currentImageIndex.value = 7
  }
}
onMounted(() => {
  const canvas = document.getElementById('canvas');
  let lastX = 0;
  let lastY = 0;
  let lastTime = 0;
  const flingThreshold = 150; // 阈值，根据需要调整
  const timeLimit = 10; // 时间限制，单位毫秒

  canvas.addEventListener('mousemove', function (event) {
    const currentTime = new Date().getTime();
    const deltaX = event.clientX - lastX;
    const deltaY = event.clientY - lastY;
    const distance = Math.sqrt(deltaX * deltaX + deltaY * deltaY);

    if (currentTime - lastTime < timeLimit) {
      if (distance > flingThreshold) {
        // alert('Mouse fling detected!');
        // 这里可以触发你的“甩动”事件处理逻辑
        iconStyle.value = {
          transform: "rotate(360deg)",
          boxShadow: "0 0 20px 11px rgba(255, 255, 255, 0.7)",
          backgroundColor: "rgba(255, 255, 255, 0.7)"
        }

        setTimeout(()=>{
          iconStyle.value = {
          transform: "rotate(-360deg)"
        }
        },1000)
      }
    }
  
    lastX = event.clientX;
    lastY = event.clientY;
    lastTime = currentTime;
  });
})
</script>


<style scoped>
.icon {
  transition: transform 0.5s ease;
  width: 50px;
  height: 50px;
}

.icon-wrapper {
  cursor: pointer;
  /* 显示指针手势 */
  transition: transform 0.5s ease;
  border-radius: 100%;
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: center;
  width: 80px;
  height: 80px;
  margin-bottom: 20px;
  margin-left:15px;
  padding: 9px;
}

.icon:hover {
  transform: scale(1.2) rotate(360deg);
}

.icon-group {
  margin: 10px;
  padding: 10px;
}

.cursor::after {
  content: '';
  display: block;
  position: absolute;
  top: -5px;
  left: -5px;
  width: 20px;
  /* 自定义光标宽度 */
  height: 20px;
  /* 自定义光标高度 */
  background-color: red;
  border-radius: 50%;
  pointer-events: none;
  /* 防止伪元素影响点击事件 */
}

.control-group {
  display: flex;
  justify-content: center;
  background: rgba(255, 255, 255, 0.7);
  text-align: center;
}

.btn {
  padding-inline: 10px;
  margin: 8px;
  width: 50px;
}
</style>
